app/controllers/posts_controller.rb

  def show
    @post = Post.friendly.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]